app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO `users` (`first_name`, `last_name`, `email`, `phone_no`, `created_at`, `updated_at`) VALUES ('Roli Tandon', 'Tandon', 'rlkhattri12@gmail.com', '9999998999', '2024-06-13 12:04:59', '2024-06-13 12:04:59')

  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 11 LIMIT 1
UPDATE `users` SET `first_name` = 'Roli', `updated_at` = '2024-06-13 12:11:21' WHERE `users`.`id` = 11